---
type: StructuralSectionCSlopedFlange
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 4
tags: [revit-api, class]
---

# StructuralSectionCSlopedFlange

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCSlopedFlange` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionCSlopedFlange | 2015 | `public StructuralSectionCSlopedFlange ( double width , double height , double flangeThickness , double flangeThicknessLocation , double webThickness , double webFillet , double flangeFillet , double centroidHorizontal , ` |
| Property | BoltDiameter | 2015 | `public double BoltDiameter { get ; set ; }` |
| Property | BoltSpacing | 2015 | `public double BoltSpacing { get ; set ; }` |
| Property | ClearWebHeight | 2015 | `public double ClearWebHeight { get ; set ; }` |